{
  "posts": [
    {
      "id": "the-great-lebanese-salad-debate-part-1",
      "slug": "the-great-lebanese-salad-debate-part-1",
      "title": "The Great Lebanese Salad Debate (Part 1)",
      "subtitle": "Tabbouleh, and why ours might just end the debate!",
      "excerpt": "In Lebanon, there's a question that can split a dinner table faster than politics: Tabbouleh or Fattoush? Both are served at almost every mezze spread. Both are fresh, herby, and go with just about everything. But ask any Lebanese person which one reigns supreme...",
      "image": "/images/catering/tabbouleh.webp",
      "date": "2025-12-15",
      "readTime": "4 min read",
      "tags": ["Tradition", "The Debate", "At the Table"],
      "content": [
        {
          "type": "paragraph",
          "text": "In Lebanon, there's a question that can split a dinner table faster than politics: *Tabbouleh or Fattoush?*"
        },
        {
          "type": "paragraph",
          "text": "Both are served at almost every mezze spread. Both are fresh, herby, and go with just about everything. But ask any Lebanese person which one reigns supreme, and you'll get a passionate answer. There's no sitting on the fence."
        },
        {
          "type": "paragraph",
          "text": "Fattoush lovers will tell you it's about the crunch. The crispy flatbread, the sumac tang, the mix of whatever vegetables are in season. It's casual, generous, forgiving."
        },
        {
          "type": "paragraph",
          "text": "Tabbouleh people? They believe in precision. In tradition. In the idea that a salad can be sacred."
        },
        {
          "type": "paragraph",
          "text": "Honestly? At Maída, we're just as divided. The debate continues in our kitchen to this day. But here's what we can all agree on: our tabbouleh is *heavenly*. Whether it wins the war or not, it definitely wins plates."
        },
        {
          "type": "paragraph",
          "text": "So while we wait for the fattoush post to make its case, let's talk about why this little parsley salad deserves its moment."
        },
        {
          "type": "heading",
          "text": "The Truth About Tabbouleh"
        },
        {
          "type": "paragraph",
          "text": "Here's something that surprises most people: authentic tabbouleh is not a bulgur salad with some parsley on top. It's a *parsley salad* with a whisper of bulgur, if any at all."
        },
        {
          "type": "paragraph",
          "text": "Somewhere along the way, the ratio got flipped. What should be an ocean of bright green herbs became a beige grain bowl with a parsley garnish. The mountains of Lebanon would like a word."
        },
        {
          "type": "paragraph",
          "text": "The original tabbouleh is:"
        },
        {
          "type": "list",
          "items": [
            "Aggressively green — parsley is the star, not the sidekick",
            "Finely chopped by hand — never a food processor, as it bruises the leaves",
            "Dressed simply with lemon, olive oil, and salt",
            "Scooped and eaten with crisp romaine, young cabbage leaves, or warm Lebanese bread"
          ]
        },
        {
          "type": "callout",
          "text": "Aggressively green. Just the way it should be."
        },
        {
          "type": "heading",
          "text": "Our Bulgur Confession"
        },
        {
          "type": "paragraph",
          "text": "We'll admit it: we used to be bulgur people."
        },
        {
          "type": "paragraph",
          "text": "We added it, just a little, soaked and soft, the way many Lebanese households do. It's not wrong. It's tradition too. But then we tasted tabbouleh made the old mountain way: no grain, just pure herb intensity."
        },
        {
          "type": "paragraph",
          "text": "And we converted."
        },
        {
          "type": "paragraph",
          "text": "Without bulgur, the salad is lighter, brighter, and hits different. You taste the parsley. You feel the lemon. Every bite is clean and alive."
        },
        {
          "type": "paragraph",
          "text": "Here's a bit of history: bulgur was traditionally added by families who wanted to make the dish more filling and satisfying, stretching it further when fresh herbs and vegetables were expensive. It became common, but it was never the original way. The purest tabbouleh from the Lebanese mountains has always been about the greens."
        },
        {
          "type": "highlight",
          "text": "No bulgur. No compromise."
        },
        {
          "type": "heading",
          "text": "How We Make Ours"
        },
        {
          "type": "paragraph",
          "text": "Our tabbouleh at Maída follows the traditional method:"
        },
        {
          "type": "list",
          "items": [
            "Flat-leaf parsley, chopped fine but not pulverized",
            "Fresh mint for that cool undertone",
            "Ripe tomatoes, diced small, salted to release their juice",
            "Spring onion, finely sliced",
            "A generous squeeze of lemon and our house olive oil",
            "No bulgur. No compromise."
          ]
        },
        {
          "type": "paragraph",
          "text": "Pair it with our honey roasted halloumi or scoop it alongside hummus and warm saj. Or do what the Lebanese do: tear off a romaine leaf and use it as your spoon. Or, like our own Anthony does, just wrap it in warm saj bread and call it a perfect bite."
        },
        {
          "type": "heading",
          "text": "A Few Things You Might Not Know"
        },
        {
          "type": "list",
          "items": [
            "The word \"tabbouleh\" comes from the Arabic *tabil*, meaning \"to season\" or \"to spice\"",
            "In Lebanese villages, tabbouleh is traditionally made by the women of the house, and the fineness of the chop is a point of pride. A grandmother can tell your character by how you cut your parsley. No pressure.",
            "And here's the unspoken rule: tabbouleh is mezze, not a main. But if you want to order a whole bowl and call it dinner, we won't tell anyone."
          ]
        },
        {
          "type": "heading",
          "text": "Come Taste the Difference"
        },
        {
          "type": "paragraph",
          "text": "We don't follow trends. We set the record straight. This is tabbouleh the way it's meant to be. Bright, herby, alive."
        },
        {
          "type": "cta",
          "text": "#MeetMeAtMaída and taste the tabbouleh for yourself."
        }
      ],
      "relatedPosts": [
        {
          "title": "The Case for Fattoush",
          "subtitle": "Part 2 - Coming Soon",
          "slug": null
        },
        {
          "title": "Hummus: The Great Unifier",
          "subtitle": "Coming Soon",
          "slug": null
        }
      ]
    }
  ],
  "tags": ["Tradition", "The Debate", "At the Table", "Recipes", "Stories"]
}
